MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS202A/mcu.h
/* CMPDAC2 */
/* Bitname _CMREF cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF0 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF1 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF2 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF3 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF4 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF5 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF6 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF7 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF8 cannot be defined because it is used by more than one SFR */
/* Bitname _CMREF9 cannot be defined because it is used by more than one SFR */

/* RPINR0 */
#define _INT1R RPINR0bits.INT1R
#define _INT1R0 RPINR0bits.INT1R0
#define _INT1R1 RPINR0bits.INT1R1
#define _INT1R2 RPINR0bits.INT1R2
#define _INT1R3 RPINR0bits.INT1R3
#define _INT1R4 RPINR0bits.INT1R4
#define _INT1R5 RPINR0bits.INT1R5

/* RPINR1 */
#define _INT2R RPINR1bits.INT2R
#define _INT2R0 RPINR1bits.INT2R0
#define _INT2R1 RPINR1bits.INT2R1
#define _INT2R2 RPINR1bits.INT2R2
#define _INT2R3 RPINR1bits.INT2R3
#define _INT2R4 RPINR1bits.INT2R4
#define _INT2R5 RPINR1bits.INT2R5

/* RPINR2 */
#define _T1CKR RPINR2bits.T1CKR
#define _T1CKR0 RPINR2bits.T1CKR0
#define _T1CKR1 RPINR2bits.T1CKR1
#define _T1CKR2 RPINR2bits.T1CKR2
#define _T1CKR3 RPINR2bits.T1CKR3
#define _T1CKR4 RPINR2bits.T1CKR4
#define _T1CKR5 RPINR2bits.T1CKR5

/* RPINR3 */
#define _T2CKR RPINR3bits.T2CKR
#define _T2CKR0 RPINR3bits.T2CKR0
#define _T2CKR1 RPINR3bits.T2CKR1
#define _T2CKR2 RPINR3bits.T2CKR2
#define _T2CKR3 RPINR3bits.T2CKR3
#define _T2CKR4 RPINR3bits.T2CKR4
#define _T2CKR5 RPINR3bits.T2CKR5

/* RPINR7 */
#define _IC1R RPINR7bits.IC1R
#define _IC1R0 RPINR7bits.IC1R0
#define _IC1R1 RPINR7bits.IC1R1
#define _IC1R2 RPINR7bits.IC1R2
#define _IC1R3 RPINR7bits.IC1R3
#define _IC1R4 RPINR7bits.IC1R4
#define _IC1R5 RPINR7bits.IC1R5

/* RPINR11 */
#define _OCFAR RPINR11bits.OCFAR
#define _OCFAR0 RPINR11bits.OCFAR0
#define _OCFAR1 RPINR11bits.OCFAR1
#define _OCFAR2 RPINR11bits.OCFAR2
#define _OCFAR3 RPINR11bits.OCFAR3
#define _OCFAR4 RPINR11bits.OCFAR4
#define _OCFAR5 RPINR11bits.OCFAR5

/* RPINR18 */
#define _U1RXR RPINR18bits.U1RXR
#define _U1CTSR RPINR18bits.U1CTSR
#define _U1RXR0 RPINR18bits.U1RXR0
#define _U1RXR1 RPINR18bits.U1RXR1
#define _U1RXR2 RPINR18bits.U1RXR2
#define _U1RXR3 RPINR18bits.U1RXR3
#define _U1RXR4 RPINR18bits.U1RXR4
#define _U1RXR5 RPINR18bits.U1RXR5
#define _U1CTSR0 RPINR18bits.U1CTSR0
#define _U1CTSR1 RPINR18bits.U1CTSR1
#define _U1CTSR2 RPINR18bits.U1CTSR2
#define _U1CTSR3 RPINR18bits.U1CTSR3
#define _U1CTSR4 RPINR18bits.U1CTSR4
#define _U1CTSR5 RPINR18bits.U1CTSR5

/* RPINR20 */
#define _SDI1R RPINR20bits.SDI1R
#define _SCK1R RPINR20bits.SCK1R
#define _SDI1R0 RPINR20bits.SDI1R0
#define _SDI1R1 RPINR20bits.SDI1R1
#define _SDI1R2 RPINR20bits.SDI1R2
#define _SDI1R3 RPINR20bits.SDI1R3
#define _SDI1R4 RPINR20bits.SDI1R4
#define _SDI1R5 RPINR20bits.SDI1R5
#define _SCK1R0 RPINR20bits.SCK1R0
#define _SCK1R1 RPINR20bits.SCK1R1
#define _SCK1R2 RPINR20bits.SCK1R2
#define _SCK1R3 RPINR20bits.SCK1R3
#define _SCK1R4 RPINR20bits.SCK1R4
#define _SCK1R5 RPINR20bits.SCK1R5

/* RPINR21 */
#define _SS1R RPINR21bits.SS1R
#define _SS1R0 RPINR21bits.SS1R0
#define _SS1R1 RPINR21bits.SS1R1
#define _SS1R2 RPINR21bits.SS1R2
#define _SS1R3 RPINR21bits.SS1R3
#define _SS1R4 RPINR21bits.SS1R4
#define _SS1R5 RPINR21bits.SS1R5

/* RPINR29 */
#define _FLT1R RPINR29bits.FLT1R
#define _FLT1R0 RPINR29bits.FLT1R0
#define _FLT1R1 RPINR29bits.FLT1R1
#define _FLT1R2 RPINR29bits.FLT1R2
#define _FLT1R3 RPINR29bits.FLT1R3
#define _FLT1R4 RPINR29bits.FLT1R4
#define _FLT1R5 RPINR29bits.FLT1R5

/* RPINR30 */
#define _FLT2R RPINR30bits.FLT2R
#define _FLT3R RPINR30bits.FLT3R
#define _FLT2R0 RPINR30bits.FLT2R0
#define _FLT2R1 RPINR30bits.FLT2R1
#define _FLT2R2 RPINR30bits.FLT2R2
#define _FLT2R3 RPINR30bits.FLT2R3
#define _FLT2R4 RPINR30bits.FLT2R4
#define _FLT2R5 RPINR30bits.FLT2R5
#define _FLT3R0 RPINR30bits.FLT3R0
#define _FLT3R1 RPINR30bits.FLT3R1
#define _FLT3R2 RPINR30bits.FLT3R2
#define _FLT3R3 RPINR30bits.FLT3R3
#define _FLT3R4 RPINR30bits.FLT3R4
#define _FLT3R5 RPINR30bits.FLT3R5

/* RPINR31 */
#define _FLT4R RPINR31bits.FLT4R
#define _FLT5R RPINR31bits.FLT5R
#define _FLT4R0 RPINR31bits.FLT4R0
#define _FLT4R1 RPINR31bits.FLT4R1
#define _FLT4R2 RPINR31bits.FLT4R2
#define _FLT4R3 RPINR31bits.FLT4R3
#define _FLT4R4 RPINR31bits.FLT4R4
#define _FLT4R5 RPINR31bits.FLT4R5
#define _FLT5R0 RPINR31bits.FLT5R0
#define _FLT5R1 RPINR31bits.FLT5R1
#define _FLT5R2 RPINR31bits.FLT5R2
#define _FLT5R3 RPINR31bits.FLT5R3
#define _FLT5R4 RPINR31bits.FLT5R4
#define _FLT5R5 RPINR31bits.FLT5R5

/* RPINR32 */
#define _FLT6R RPINR32bits.FLT6R
#define _FLT7R RPINR32bits.FLT7R
#define _FLT6R0 RPINR32bits.FLT6R0
#define _FLT6R1 RPINR32bits.FLT6R1
#define _FLT6R2 RPINR32bits.FLT6R2
#define _FLT6R3 RPINR32bits.FLT6R3
#define _FLT6R4 RPINR32bits.FLT6R4
#define _FLT6R5 RPINR32bits.FLT6R5
#define _FLT7R0 RPINR32bits.FLT7R0
#define _FLT7R1 RPINR32bits.FLT7R1
#define _FLT7R2 RPINR32bits.FLT7R2
#define _FLT7R3 RPINR32bits.FLT7R3
#define _FLT7R4 RPINR32bits.FLT7R4
#define _FLT7R5 RPINR32bits.FLT7R5

/* RPINR33 */
#define _FLT8R RPINR33bits.FLT8R
#define _SYNCI1R RPINR33bits.SYNCI1R
#define _FLT8R0 RPINR33bits.FLT8R0
#define _FLT8R1 RPINR33bits.FLT8R1
#define _FLT8R2 RPINR33bits.FLT8R2
#define _FLT8R3 RPINR33bits.FLT8R3
#define _FLT8R4 RPINR33bits.FLT8R4
#define _FLT8R5 RPINR33bits.FLT8R5
#define _SYNCI1R0 RPINR33bits.SYNCI1R0
#define _SYNCI1R1 RPINR33bits.SYNCI1R1
#define _SYNCI1R2 RPINR33bits.SYNCI1R2
#define _SYNCI1R3 RPINR33bits.SYNCI1R3
#define _SYNCI1R4 RPINR33bits.SYNCI1R4
#define _SYNCI1R5 RPINR33bits.SYNCI1R5

/* RPINR34 */
#define _SYNCI2R RPINR34bits.SYNCI2R
#define _SYNCI2R0 RPINR34bits.SYNCI2R0
#define _SYNCI2R1 RPINR34bits.SYNCI2R1
#define _SYNCI2R2 RPINR34bits.SYNCI2R2
#define _SYNCI2R3 RPINR34bits.SYNCI2R3
#define _SYNCI2R4 RPINR34bits.SYNCI2R4
#define _SYNCI2R5 RPINR34bits.SYNCI2R5

/* RPOR0 */
#define _RP0R RPOR0bits.RP0R
#define _RP1R RPOR0bits.RP1R
#define _RP0R0 RPOR0bits.RP0R0
#define _RP0R1 RPOR0bits.RP0R1
#define _RP0R2 RPOR0bits.RP0R2
#define _RP0R3 RPOR0bits.RP0R3
#define _RP0R4 RPOR0bits.RP0R4
#define _RP0R5 RPOR0bits.RP0R5
#define _RP1R0 RPOR0bits.RP1R0
#define _RP1R1 RPOR0bits.RP1R1
#define _RP1R2 RPOR0bits.RP1R2
#define _RP1R3 RPOR0bits.RP1R3
#define _RP1R4 RPOR0bits.RP1R4
#define _RP1R5 RPOR0bits.RP1R5

