MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS202A/mcu.h
#define _CMPCON2_EXTREF_POSITION                 0x00000005
#define _CMPCON2_EXTREF_MASK                     0x00000020
#define _CMPCON2_EXTREF_LENGTH                   0x00000001

#define _CMPCON2_INSEL_POSITION                  0x00000006
#define _CMPCON2_INSEL_MASK                      0x000000C0
#define _CMPCON2_INSEL_LENGTH                    0x00000002

#define _CMPCON2_DACOE_POSITION                  0x00000008
#define _CMPCON2_DACOE_MASK                      0x00000100
#define _CMPCON2_DACOE_LENGTH                    0x00000001

#define _CMPCON2_FCLKSEL_POSITION                0x00000009
#define _CMPCON2_FCLKSEL_MASK                    0x00000200
#define _CMPCON2_FCLKSEL_LENGTH                  0x00000001

#define _CMPCON2_FLTREN_POSITION                 0x0000000A
#define _CMPCON2_FLTREN_MASK                     0x00000400
#define _CMPCON2_FLTREN_LENGTH                   0x00000001

#define _CMPCON2_HYSSEL_POSITION                 0x0000000B
#define _CMPCON2_HYSSEL_MASK                     0x00001800
#define _CMPCON2_HYSSEL_LENGTH                   0x00000002

#define _CMPCON2_CMPSIDL_POSITION                0x0000000D
#define _CMPCON2_CMPSIDL_MASK                    0x00002000
#define _CMPCON2_CMPSIDL_LENGTH                  0x00000001

#define _CMPCON2_CMPON_POSITION                  0x0000000F
#define _CMPCON2_CMPON_MASK                      0x00008000
#define _CMPCON2_CMPON_LENGTH                    0x00000001

#define _CMPCON2_INSEL0_POSITION                 0x00000006
#define _CMPCON2_INSEL0_MASK                     0x00000040
#define _CMPCON2_INSEL0_LENGTH                   0x00000001

#define _CMPCON2_INSEL1_POSITION                 0x00000007
#define _CMPCON2_INSEL1_MASK                     0x00000080
#define _CMPCON2_INSEL1_LENGTH                   0x00000001

#define _CMPDAC2_CMREF_POSITION                  0x00000000
#define _CMPDAC2_CMREF_MASK                      0x000003FF
#define _CMPDAC2_CMREF_LENGTH                    0x0000000A

#define _CMPDAC2_CMREF0_POSITION                 0x00000000
#define _CMPDAC2_CMREF0_MASK                     0x00000001
#define _CMPDAC2_CMREF0_LENGTH                   0x00000001

#define _CMPDAC2_CMREF1_POSITION                 0x00000001
#define _CMPDAC2_CMREF1_MASK                     0x00000002
#define _CMPDAC2_CMREF1_LENGTH                   0x00000001

#define _CMPDAC2_CMREF2_POSITION                 0x00000002
#define _CMPDAC2_CMREF2_MASK                     0x00000004
#define _CMPDAC2_CMREF2_LENGTH                   0x00000001

#define _CMPDAC2_CMREF3_POSITION                 0x00000003
#define _CMPDAC2_CMREF3_MASK                     0x00000008
#define _CMPDAC2_CMREF3_LENGTH                   0x00000001

#define _CMPDAC2_CMREF4_POSITION                 0x00000004
#define _CMPDAC2_CMREF4_MASK                     0x00000010
#define _CMPDAC2_CMREF4_LENGTH                   0x00000001

#define _CMPDAC2_CMREF5_POSITION                 0x00000005
#define _CMPDAC2_CMREF5_MASK                     0x00000020
#define _CMPDAC2_CMREF5_LENGTH                   0x00000001

#define _CMPDAC2_CMREF6_POSITION                 0x00000006
#define _CMPDAC2_CMREF6_MASK                     0x00000040
#define _CMPDAC2_CMREF6_LENGTH                   0x00000001

#define _CMPDAC2_CMREF7_POSITION                 0x00000007
#define _CMPDAC2_CMREF7_MASK                     0x00000080
#define _CMPDAC2_CMREF7_LENGTH                   0x00000001

#define _CMPDAC2_CMREF8_POSITION                 0x00000008
#define _CMPDAC2_CMREF8_MASK                     0x00000100
#define _CMPDAC2_CMREF8_LENGTH                   0x00000001

#define _CMPDAC2_CMREF9_POSITION                 0x00000009
#define _CMPDAC2_CMREF9_MASK                     0x00000200
#define _CMPDAC2_CMREF9_LENGTH                   0x00000001

#define _RPINR0_INT1R_POSITION                   0x00000008
#define _RPINR0_INT1R_MASK                       0x00003F00
#define _RPINR0_INT1R_LENGTH                     0x00000006

#define _RPINR0_INT1R0_POSITION                  0x00000008
#define _RPINR0_INT1R0_MASK                      0x00000100
#define _RPINR0_INT1R0_LENGTH                    0x00000001

#define _RPINR0_INT1R1_POSITION                  0x00000009
#define _RPINR0_INT1R1_MASK                      0x00000200
#define _RPINR0_INT1R1_LENGTH                    0x00000001

#define _RPINR0_INT1R2_POSITION                  0x0000000A
#define _RPINR0_INT1R2_MASK                      0x00000400
#define _RPINR0_INT1R2_LENGTH                    0x00000001

#define _RPINR0_INT1R3_POSITION                  0x0000000B
#define _RPINR0_INT1R3_MASK                      0x00000800
#define _RPINR0_INT1R3_LENGTH                    0x00000001

#define _RPINR0_INT1R4_POSITION                  0x0000000C
#define _RPINR0_INT1R4_MASK                      0x00001000
#define _RPINR0_INT1R4_LENGTH                    0x00000001

#define _RPINR0_INT1R5_POSITION                  0x0000000D
#define _RPINR0_INT1R5_MASK                      0x00002000
#define _RPINR0_INT1R5_LENGTH                    0x00000001

#define _RPINR1_INT2R_POSITION                   0x00000000
#define _RPINR1_INT2R_MASK                       0x0000003F
#define _RPINR1_INT2R_LENGTH                     0x00000006

#define _RPINR1_INT2R0_POSITION                  0x00000000
#define _RPINR1_INT2R0_MASK                      0x00000001
#define _RPINR1_INT2R0_LENGTH                    0x00000001

#define _RPINR1_INT2R1_POSITION                  0x00000001
#define _RPINR1_INT2R1_MASK                      0x00000002
#define _RPINR1_INT2R1_LENGTH                    0x00000001

#define _RPINR1_INT2R2_POSITION                  0x00000002
#define _RPINR1_INT2R2_MASK                      0x00000004
#define _RPINR1_INT2R2_LENGTH                    0x00000001

#define _RPINR1_INT2R3_POSITION                  0x00000003
#define _RPINR1_INT2R3_MASK                      0x00000008
#define _RPINR1_INT2R3_LENGTH                    0x00000001

#define _RPINR1_INT2R4_POSITION                  0x00000004
#define _RPINR1_INT2R4_MASK                      0x00000010
#define _RPINR1_INT2R4_LENGTH                    0x00000001

#define _RPINR1_INT2R5_POSITION                  0x00000005
#define _RPINR1_INT2R5_MASK                      0x00000020
#define _RPINR1_INT2R5_LENGTH                    0x00000001

#define _RPINR2_T1CKR_POSITION                   0x00000008
#define _RPINR2_T1CKR_MASK                       0x00003F00
#define _RPINR2_T1CKR_LENGTH                     0x00000006

#define _RPINR2_T1CKR0_POSITION                  0x00000008
#define _RPINR2_T1CKR0_MASK                      0x00000100
#define _RPINR2_T1CKR0_LENGTH                    0x00000001

#define _RPINR2_T1CKR1_POSITION                  0x00000009
#define _RPINR2_T1CKR1_MASK                      0x00000200
#define _RPINR2_T1CKR1_LENGTH                    0x00000001

#define _RPINR2_T1CKR2_POSITION                  0x0000000A
#define _RPINR2_T1CKR2_MASK                      0x00000400
#define _RPINR2_T1CKR2_LENGTH                    0x00000001

#define _RPINR2_T1CKR3_POSITION                  0x0000000B
#define _RPINR2_T1CKR3_MASK                      0x00000800
#define _RPINR2_T1CKR3_LENGTH                    0x00000001

