MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC33FJ06GS202A/mcu.h
/*
** Only one invocation of FOSCSEL should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FOSCSEL.
** Multiple options may be combined, as shown:
**
** _FOSCSEL( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Oscillator Source Selection:
**     FNOSC_FRC            Internal Fast RC (FRC)
**     FNOSC_FRCPLL         Fast RC Oscillator with divide-by-N with PLL module (FRCPLL)
**     FNOSC_PRI            Primary Oscillator (XT, HS, EC)
**     FNOSC_PRIPLL         Primary Oscillator with PLL module (XT + PLL, HS + PLL, EC + PLL)
**     FNOSC_LPRC           Low-Power RC Oscillator (LPRC)
**     FNOSC_FRCDIVN        Internal Fast RC (FRC) Oscillator with postscaler
**
**   Two-speed Oscillator Start-up Enable bit:
**     IESO_OFF             Start up with user-selected oscillator source
**     IESO_ON              Start up device with FRC, then switch to user-selected oscillator source
**
*/

#define FNOSC_FRC            0x0080
#define FNOSC_FRCPLL         0x0081
#define FNOSC_PRI            0x0082
#define FNOSC_PRIPLL         0x0083
#define FNOSC_LPRC           0x0085
#define FNOSC_FRCDIVN        0x0087

#define IESO_OFF             0x0007
#define IESO_ON              0x0087

/* Register FGS (0xffa)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FGS;
#define _FGS(x) __attribute__((address(0xffa),deprecated_definition("consider migrating to #pragma config"),section("__FGS.sec"),space(prog))) __prog__ uint16_t _FGS = (x);

/*
** Only one invocation of FGS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FGS.
** Multiple options may be combined, as shown:
**
** _FGS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   General Segment Write-Protect bit:
**     GWRP_ON              General Segment is write protected
**     GWRP_OFF             General Segment may be written
**
**   General Segment Code-Protect bit:
**     GCP_ON               General Segment Code protection Enabled
**     GCP_OFF              General Segment Code protect is Disabled
**
*/

#define GWRP_ON              0x0002
#define GWRP_OFF             0x0003

#define GCP_ON               0x0001
#define GCP_OFF              0x0003



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0xdf0

#define __FICD_BASE 0xff0
#define __FICD_LENGTH 0x2

#define __FWDT_BASE 0xff4
#define __FWDT_LENGTH 0x2

#define __FOSC_BASE 0xff6
#define __FOSC_LENGTH 0x2

#define __FOSCSEL_BASE 0xff8
#define __FOSCSEL_LENGTH 0x2

#define __FGS_BASE 0xffa
#define __FGS_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x400

#define __YDATA_BASE 0xa00
#define __YDATA_LENGTH 0xa00
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x400

#define __YDATA_BASE 0xa00
#define __YDATA_LENGTH 0xa00
#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x400

#define __YDATA_BASE 0xa00
#define __YDATA_LENGTH 0xa00

/*
 * PPS Remapping Pin Names
 */

#define _RPOUT_U1TX 3
#define _RPOUT_U1RTS 4
#define _RPOUT_SDO1 7
#define _RPOUT_SCK1 8
#define _RPOUT_SS1 9
#define _RPOUT_OC1 18
#define _RPOUT_SYNCO1 37
#define _RPOUT_REFCLKO 38
#define _RPOUT_ACMP1 39
#define _RPOUT_ACMP2 40
#define _RPOUT_PWM4H 44
#define _RPOUT_PWM4L 45

#endif
